[
  "Kushagra Singh is a Final Year Computer Science Engineering student at MIT World Peace University, Pune, passionate about building impactful tech solutions at the crossroads of Artificial Intelligence, Machine Learning, Web Development, and Embedded Systems. As the Technical Head of the IRIS Tech Club, he leads a team of developers delivering innovative projects. He's interested in the AI/ML and Software Developer domains.",
  "Kushagra is highly skilled in multiple domains:\n- Programming Languages: Python, C, C++, Java, JavaScript\n- Machine Learning: PyTorch, TensorFlow, Scikit-Learn, HuggingFace, LangChain, OpenCV, NLTK, spaCy\n- Web Development: Next.js, React, Node.js, Express.js, FastAPI, Spring Boot\n- Databases: MySQL, MongoDB, PostgreSQL, MongoDB Atlas\n- Cloud & DevOps: AWS, Kubernetes, Docker, CI/CD Pipelines, Minikube\n- Big Data: Apache Spark, HDFS, Kafka, Hive, HBase, Cloudera\n- Embedded Systems: Arduino, STM32, ESP32, Raspberry Pi\n- Visualization: Tableau, Matplotlib, Seaborn\n- Generative AI: LLaMA-3, Retrieval-Augmented Generation",
  "Kushagra has led several high-impact projects:\n1) Adobe Hackathon Finalist - AI-powered PDF analysis platform using Google Gemini and Azure Speech\n2) Mitsubishi Hackathon Winner - AI-Powered Superannuation Advisor Dashboard with ML-driven retirement projections\n3) Government Research Project - STIV-based Velocity Estimation for CWPRS (GOI)\n4) IRIS Club RAG Chatbot - Research paper published at IEEE ICoICC 2025\n5) Bosch Hackathon Finalist - Autonomous Traffic Management System with YOLOv8 and ESP32\n6) DocsVerse - Document Research Chatbot with RAG and OCR\n7) SynapTrack - Parkinson's Detection using EEG analysis\n8) Data Orchestrate - Distributed File Sync with Java and Kubernetes\n9) Airfield Wildlife Risk Classification - Real-time bird detection system\n10) MedTech Diagnostic LLM Pipeline - AI diagnostic pipeline with medical image segmentation\n11) IRIS Club Website - Full-stack platform with payment integration\n12) PlantWise - Ayurvedic AI Companion (Top 25 at SIH 2024)\n13) Driver Safety Monitoring System - Embedded system for monitoring driver behavior",
  "Yes, Kushagra Singh co-authored a research paper titled 'Domain-Specific Conversational AI for IRIS MITWPU: From Research Paper to Production' which was published in the IEEE International Conference on Information, Communication and Computing Technology (ICoICC) 2025. The paper presents a comprehensive comparison between Retrieval-Augmented Generation (RAG) and Fine-Tuned Transformer approaches for implementing domain-specific chatbots. He implemented a RAG pipeline using LangChain, HuggingFace embeddings, FAISS, and LLaMA-3 70B model via Groq API, and built a fine-tuned DistilBERT model optimized for question-answering tasks.",
  "Kushagra has diverse professional experience:\n- Technical Head at IRIS, MIT WPU (Aug 2024-Present): Leading technical initiatives, managing the club's website development, and developing an autonomous vehicle module for non-ADAS cars.\n- Machine Learning Research Associate at IIMT University (Jan 2025-Mar 2025): Led an AI-driven machine learning research project for Cardiovascular Disease risk prediction, contributing to a PhD study in healthcare analytics.\n- ML Project Intern at Infosys Springboard (Oct 2024-Dec 2024): Designed and implemented a handwritten digit recognition application using neural networks (MLP, CNN, LeNet5) for MNIST dataset classification.",
  "Kushagra has earned several notable achievements:\n- Winner of the Mitsubishi UFJ Financial Group (MUFG) Hackathon 2025\n- Top 18 Finalist at the Bosch BOROSA Hackathon 2025\n- Top 100 out of 260,000+ participants at the Adobe Hackathon 2025\n- Top 25 Finalist at the Smart India Hackathon 2024\n- Finalist at HackMITWPU'24 Ideathon\n- Published researcher in IEEE ICoICC 2025",
  "Kushagra is pursuing a B.Tech in Computer Science Engineering at MIT World Peace University, Pune (2021-2025). He's currently in his final year and is passionate about AI/ML and Software Development domains.",
  "You can reach Kushagra through the following channels:\n- Email: kushagraa.n@gmail.com\n- LinkedIn: https://www.linkedin.com/in/kushagra-anit-singh/\n- GitHub: https://github.com/kushagra-a-singh\n- Google Scholar: https://scholar.google.com/citations?user=upUymaUAAAAJ&hl=en\n- Linktree: https://linktr.ee/kushagra_singh\n\nYou can also use the contact form on his portfolio website.",
  "For the Adobe Hackathon 2025, Kushagra built an AI-powered PDF analysis platform for semantic search, cross-document insights, and intelligent summarization using all-MiniLM-L6-v2 embeddings. He integrated Google Gemini LLM and Azure Speech Services for context-aware reasoning and natural voice podcast generation. The project was deployed on AWS with Dockerized microservices and optimized vector indexing for <3s query latency. This project placed in the Top 100 out of 260,000+ participants.",
  "Kushagra won the Mitsubishi UFJ Financial Group (MUFG) Hackathon 2025 by developing an AI-powered financial assistant for personalized retirement planning. He developed a voice-enabled financial advisor dashboard with ML-driven retirement projections, portfolio insights, and real-time AI recommendations. The project integrated XGBoost, Logistic Regression, and KMeans models for user segmentation, risk prediction, and personalized investment suggestions, along with an LLM chatbot with Azure Speech Services for conversational, voice-based financial guidance and automated email updates.",
  "Kushagra is partnering with Central Water and Power Research Station (CWPRS), Government of India, to develop an advanced AI/ML-based velocity estimation system tested at Khadakwasla Dam, Pune. He's implementing pyOpenRiverCam for Large-scale Particle Image Velocimetry (LSPIV) and Space-Time Image Velocimetry (STIV) techniques to accurately measure surface water velocities. The project involves processing high-resolution video data to deliver precise flow analysis, enabling CWPRS's hydrological research and infrastructure monitoring.",
  "The IRIS Club RAG Chatbot is a domain-specific AI assistant Kushagra engineered using LLaMA-3 70B, FAISS-based semantic search, and LangChain for efficient IRIS club information retrieval. He published research on hybrid Retrieval-Augmented Generation and fine-tuned transformer models for chatbot implementation, achieving 0.92 BERTScore accuracy. The chatbot was implemented via LangChain, HuggingFace embeddings, FAISS, and Groq API, optimized for 10ms query latency and 200+ daily queries.",
  "Kushagra is proficient in full-stack web development with expertise in:\n- Frontend: React, Next.js, TypeScript, HTML, CSS, Bootstrap\n- Backend: Node.js, Express.js, Spring Boot, FastAPI\n- Databases: PostgreSQL, MongoDB, MySQL, MongoDB Atlas\n- Real-time: WebSockets\n- Payment Integration: Razorpay\n- Authentication: Supabase\n- Deployment: AWS, Docker",
  "Kushagra has extensive machine learning expertise including:\n- Frameworks: PyTorch, TensorFlow, Scikit-learn\n- NLP: NLTK, spaCy, HuggingFace, LangChain\n- Computer Vision: OpenCV, YOLOv8\n- Generative AI: LLaMA-3, Retrieval-Augmented Generation\n- Medical AI: MONAI, Swin UNETR\n- Vector Databases: FAISS, ChromaDB\n- Data Processing: Pandas, NumPy\n- Visualization: Matplotlib, Seaborn, Tableau\n- UI: Streamlit, PyQt5, Tkinter",
  "Kushagra has worked extensively with embedded systems including:\n- Microcontrollers: Arduino, STM32, ESP32, Raspberry Pi\n- Sensors: Ultrasonic Sensors, MQ3 alcohol sensor, accelerometer, GPS, GSM modules\n- Applications: Autonomous vehicle modules, driver safety monitoring systems, traffic management systems\n- Programming: C, C++\n- IoT: MQTT",
  "For the Bosch BOROSA Hackathon 2025, Kushagra developed an Autonomous Traffic Management System, integrating YOLOv8 for traffic and crosswalk detection with ESP32 hardware for real-time signal control. He implemented MQTT for smooth communication between detection and traffic pods, managing multiple traffic states (GO, SLOW, HALT) with buzzer alerts, demonstrating real-time AI-driven embedded solutions for smart cities. The project used Roboflow to boost detection accuracy and deployed optimized ESP32 firmware for autonomous hardware actuation. This project was selected as a Top 18 Finalist.",
  "The MedTech Diagnostic LLM Pipeline is an end-to-end AI diagnostic system Kushagra built combining 3D medical image segmentation (MONAI + Swin UNETR), FAISS-based case retrieval, and LLM-driven report generation. He integrated FHIR context retrieval for clinical-grade structured inference and explainable medical reporting. The system was deployed with FastAPI backend + Next.js frontend, fully configurable via YAML and Docker-ready for GPU inference.",
  "Kushagra is familiar with several big data technologies including:\n- Apache Spark\n- Hadoop Distributed File System (HDFS)\n- Apache Kafka\n- Hive\n- HBase\n- Cloudera\n- Apache Pig\n\nHe has applied these technologies in projects like ForVis (Formula 1 Analytics) where he integrated Apache Spark and HDFS to reduce processing time by 30%.",
  "Kushagra's cloud and DevOps skills include:\n- AWS (Amazon Web Services)\n- Kubernetes\n- Docker\n- CI/CD Pipelines\n- Minikube\n\nHe has demonstrated these skills in projects like the Adobe Hackathon PDF analysis platform (deployed on AWS with Dockerized microservices) and Data Orchestrate (built with cloud-native, microservices-based architecture with Docker/Kubernetes deployment).",
  "Kushagra is proficient in multiple programming languages including:\n- Python (Advanced): For machine learning, data science, and backend development\n- JavaScript/TypeScript (Advanced): For web development with React and Next.js\n- Java (Intermediate): For enterprise applications and distributed systems\n- C/C++ (Intermediate): For embedded systems and performance-critical applications\n- SQL (Advanced): For database management and queries\n- HTML/CSS (Advanced): For frontend development and styling\n- Bash (Basic): For automation and scripting",
  "Kushagra has demonstrated strong leadership as the Technical Head of IRIS, MIT WPU's premier technical club, where he:\n- Leads a team of 20+ developers across multiple technical domains\n- Manages the development and maintenance of the club's website and technical infrastructure\n- Organizes technical workshops, hackathons, and knowledge-sharing sessions\n- Mentors junior members in various technical skills and project management\n- Spearheads innovative projects like the autonomous vehicle module and RAG chatbot\n- Collaborates with industry partners and other technical clubs for joint initiatives\n- Represents the club at various technical forums and competitions",
  "Outside of technology, Kushagra enjoys:\n- Playing Table Tennis and strategic board games\n- Reading science fiction and technical literature\n- Exploring new technologies and attending tech conferences\n- Mentoring junior students in programming and machine learning\n- Listening to music\n- Travelling and exploring new places",
  "Kushagra approaches problem-solving with a methodical and innovative mindset:\n1. First, he thoroughly analyzes the problem to understand its core requirements and constraints\n2. He researches existing solutions and best practices in the domain\n3. He breaks down complex problems into smaller, manageable components\n4. He prioritizes tasks based on impact and dependencies\n5. He implements solutions iteratively, starting with a minimum viable product\n6. He continuously tests and refines his approach based on feedback and results\n7. He documents his process and learnings for future reference\n8. He emphasizes scalable and maintainable solutions over quick fixes\n\nThis approach has served him well in hackathons, research projects, and professional work, allowing him to tackle complex challenges efficiently.",
  "Kushagra has a structured approach to learning new technologies:\n1. He starts with understanding the fundamentals and core concepts\n2. He follows official documentation and tutorials to grasp the basics\n3. He builds small proof-of-concept projects to apply what he's learned\n4. He explores advanced features through practical implementation\n5. He participates in communities, forums, and discussion groups\n6. He teaches others to solidify his understanding\n7. He contributes to open-source projects using the technology\n8. He stays updated with the latest developments through newsletters and blogs\n\nThis approach has enabled him to quickly master diverse technologies from machine learning frameworks to embedded systems programming.",
  "Kushagra's career goals include:\n- Becoming an expert in AI/ML engineering with a focus on practical applications\n- Contributing to cutting-edge research in machine learning and computer vision\n- Building products that solve real-world problems at scale\n- Leading technical teams in innovative projects\n- Bridging the gap between academic research and industry implementation\n- Mentoring the next generation of technologists\n- Eventually founding a tech startup focused on AI solutions for healthcare or environmental challenges\n- Continuing to publish research papers in prestigious conferences and journals",
  "DocsVerse is a document research chatbot Kushagra developed that combines OCR (Optical Character Recognition) with RAG (Retrieval-Augmented Generation) to enable intelligent document analysis and question-answering. The system can process multiple document formats (PDF, DOCX, images), extract text using Tesseract OCR, and create embeddings for semantic search. It uses FAISS for efficient vector similarity search and integrates with LLMs to provide contextually relevant answers to user queries about document content. The system includes a user-friendly web interface built with Next.js and features document management capabilities, conversation history, and export functionality.",
  "SynapTrack is an innovative project Kushagra developed for Parkinson's disease detection using EEG (Electroencephalogram) analysis. The system processes raw EEG signals through advanced signal processing techniques including wavelet transforms and feature extraction. It implements a hybrid deep learning model combining CNN and LSTM architectures to detect subtle patterns in brain activity associated with Parkinson's disease. The model achieved 91% accuracy in early-stage detection, significantly improving over traditional diagnostic methods. The project includes a clinician-friendly dashboard for result visualization and patient monitoring, and was developed in collaboration with healthcare professionals to ensure clinical relevance.",
  "Data Orchestrate is a distributed file synchronization system Kushagra built using Java and Kubernetes. The system enables real-time file synchronization across multiple devices with conflict resolution capabilities. It implements a microservices architecture with separate services for authentication, file management, synchronization, and notification. The system uses WebSockets for real-time updates and implements a custom versioning system to track file changes. It was deployed using Docker and Kubernetes for scalability and reliability, with automated CI/CD pipelines for continuous deployment. The project demonstrates Kushagra's expertise in distributed systems, cloud-native architecture, and enterprise Java development.",
  "The Airfield Wildlife Risk Classification project is a real-time bird detection system Kushagra developed to enhance aviation safety. The system uses computer vision with YOLOv8 for real-time detection and classification of bird species near airfields. It implements a custom-trained model on a dataset of 50,000+ images of birds commonly found near airports, achieving 94% detection accuracy. The system includes a risk assessment algorithm that evaluates factors like bird size, flock density, and flight patterns to calculate threat levels. It provides real-time alerts to air traffic control through a low-latency notification system and includes a dashboard for historical data analysis and pattern recognition. The project demonstrates Kushagra's expertise in computer vision, embedded systems, and safety-critical applications.",
  "PlantWise is an Ayurvedic AI Companion that Kushagra developed, which reached the Top 25 at Smart India Hackathon (SIH) 2024. The system combines computer vision for plant identification with a knowledge base of Ayurvedic medicine to provide personalized health recommendations. It features a mobile application with image recognition capabilities that can identify 250+ medicinal plants with 96% accuracy. The backend implements a recommendation engine that matches plant properties with user health profiles and Ayurvedic principles. The system includes features for tracking usage, providing dosage information, and warning about potential contraindications. It also offers educational content about Ayurvedic practices and sustainable harvesting methods. The project demonstrates Kushagra's ability to combine traditional knowledge with cutting-edge AI technology.",
  "The Driver Safety Monitoring System is an embedded system Kushagra developed for real-time monitoring of driver behavior and alertness. The system uses a combination of sensors including an MQ3 alcohol sensor, accelerometer, and camera to detect signs of impaired or distracted driving. It implements computer vision algorithms to track eye movement and head position for drowsiness detection. The system features real-time alerts through audio warnings and smartphone notifications when potentially dangerous behaviors are detected. It includes a secure data logging system for trip analysis and driver behavior patterns. The hardware is based on ESP32 and Arduino platforms with custom PCB design for automotive integration. The project demonstrates Kushagra's expertise in embedded systems, sensor fusion, and safety-critical applications.",
  "Kushagra is experienced with various database technologies:\n- Relational Databases: MySQL, PostgreSQL, SQLite\n- NoSQL Databases: MongoDB, MongoDB Atlas\n- Vector Databases: FAISS, ChromaDB, Pinecone\n- Time-Series Databases: InfluxDB\n- Graph Databases: Neo4j (basic knowledge)\n- In-Memory Databases: Redis\n- Big Data Storage: HBase, Hive\n\nHe has applied these database technologies in various projects, implementing complex queries, optimizing performance, designing schemas, and ensuring data integrity and security.",
  "Kushagra's strengths include:\n- Technical versatility across multiple domains (AI/ML, web development, embedded systems)\n- Strong problem-solving abilities and analytical thinking\n- Excellent leadership and team management skills\n- Ability to quickly learn and adapt to new technologies\n- Strong communication and documentation skills\n- Proven track record in competitive environments (hackathons, research)\n\nAreas he's working to improve:\n- Balancing perfectionism with pragmatic delivery timelines\n- Delegating tasks more effectively in team settings\n- Focusing on fewer technologies to develop deeper expertise\n- Improving work-life balance while maintaining productivity\n- Enhancing public speaking and presentation skills",
  "Kushagra stays updated with technology trends through multiple channels:\n- Following technical blogs and newsletters (Medium, Towards Data Science, HackerNoon)\n- Participating in online communities (Stack Overflow, GitHub, Reddit r/MachineLearning)\n- Attending virtual and in-person tech conferences and meetups\n- Taking online courses on platforms like Coursera, edX, and Udemy\n- Following industry leaders and researchers on Twitter and LinkedIn\n- Contributing to open-source projects\n- Reading academic papers on arXiv and Google Scholar\n- Experimenting with new technologies through personal projects\n- Subscribing to technical YouTube channels and podcasts",
  "Kushagra is motivated by several factors in his technical pursuits:\n- The potential of technology to solve real-world problems and improve lives\n- The intellectual challenge of tackling complex technical problems\n- The continuous learning journey and mastery of new skills\n- The collaborative nature of technical projects and knowledge sharing\n- The tangible impact of his work, especially in healthcare and environmental applications\n- The opportunity to mentor others and contribute to the tech community\n- The intersection of different disciplines and technologies\n- The rapid pace of innovation in AI and machine learning\n- The potential to contribute to cutting-edge research and development",
  "Yes, Kushagra built this entire chatbot system himself! He developed a sophisticated RAG (Retrieval-Augmented Generation) chatbot using Python, Flask, and advanced AI technologies. The tech stack includes:\n- **Backend**: Python Flask server with FAISS vector database for semantic search\n- **AI/ML**: HuggingFace embeddings (all-MiniLM-L6-v2), Groq API with LLaMA-3 70B model\n- **Vector Database**: FAISS for efficient similarity search\n- **Frontend**: React/TypeScript with Framer Motion animations\n- **Deployment**: Backend deployed on Render, Frontend on Vercel\n- **Features**: Real-time chat, semantic search, conversation logging with Supabase\nThe chatbot demonstrates his expertise in full-stack development, AI/ML integration, and modern deployment practices.",
  "Yes, Kushagra designed and developed this entire portfolio website from scratch! He built it as a comprehensive showcase of his skills and projects. The tech stack includes:\n- **Frontend**: Next.js 14 with React, TypeScript, and Tailwind CSS\n- **UI/UX**: Custom components with Framer Motion animations and responsive design\n- **Styling**: Tailwind CSS with custom gradients and dark mode support\n- **Deployment**: Hosted on Vercel with automatic deployments\n- **Features**: Interactive sections, animated components, contact forms, and integrated chatbot\n- **Performance**: Optimized for speed and SEO with best practices\nThe portfolio demonstrates his expertise in modern web development, UI/UX design, and full-stack capabilities.",
  "Kushagra used a comprehensive tech stack to build this portfolio and chatbot system:\n\n**Portfolio Website:**\n- Next.js 14 with React and TypeScript\n- Tailwind CSS for styling and responsive design\n- Framer Motion for animations\n- Vercel for deployment and hosting\n\n**Chatbot System:**\n- Python Flask backend with FAISS vector database\n- HuggingFace embeddings (all-MiniLM-L6-v2)\n- Groq API with LLaMA-3 70B model for responses\n- React/TypeScript frontend with real-time chat interface\n- Supabase for conversation logging\n- Render for backend deployment, Vercel for frontend\n\nThis demonstrates his full-stack development skills across multiple technologies and deployment platforms.",
  "Kushagra deployed this portfolio and chatbot using modern cloud platforms:\n\n**Portfolio Deployment:**\n- **Platform**: Vercel for frontend hosting\n- **Features**: Automatic deployments from GitHub, global CDN, SSL certificates\n- **Domain**: Custom domain configuration\n- **Performance**: Optimized for speed with Next.js static generation\n\n**Chatbot Deployment:**\n- **Backend**: Render for Python Flask server hosting\n- **Database**: FAISS vector database for semantic search\n- **API Integration**: HuggingFace for embeddings, Groq for LLM responses\n- **Frontend**: Integrated into the main portfolio on Vercel\n- **Monitoring**: Health checks and error handling\n\nThis deployment strategy showcases his knowledge of modern DevOps practices and cloud platforms.",
  "Yes, this entire portfolio website and chatbot system is Kushagra's personal project that he built to showcase his skills and experience. He developed everything from scratch including:\n- **Portfolio Design**: Custom UI/UX with responsive design and animations\n- **Chatbot Development**: RAG-based AI assistant with semantic search capabilities\n- **Full-Stack Integration**: Seamless connection between frontend and backend\n- **Deployment**: Multi-platform deployment strategy (Vercel + Render)\n- **Content Management**: All content, projects, and information curated by him\n\nThis project serves as both a professional showcase and a demonstration of his technical capabilities in web development, AI/ML, and modern deployment practices.",
  "Kushagra Singh is a Final Year Computer Science Engineering student at MIT World Peace University, Pune, passionate about building impactful tech solutions at the crossroads of Artificial Intelligence, Machine Learning, Web Development, and Embedded Systems. As the Technical Head of the IRIS Tech Club, he leads a team of developers delivering innovative projects. He's interested in the AI/ML and Software Developer domains.",
  "Project: Adobe Hackathon Finale – Intelligent PDF Analysis Platform\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: Python, FastAPI, Google Gemini, Azure Speech, Sentence Transformers, PDF.js, Docker, AWS\nDescription:\n- Built an AI-powered PDF analysis platform for semantic search, cross-document insights, and intelligent summarization using all-MiniLM-L6-v2 embeddings.\n",
  "Project: Mitsubishi Hackathon Winning Project: AI-Powered Superannuation Advisor Dashboard\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: TypeScript, FastAPI, XGBoost, Mistral, Azure Speech, TailwindCSS, AWS\nDescription:\n- Developed a voice-enabled financial advisor dashboard with ML-driven retirement projections, portfolio insights, and real-time AI recommendations.\n",
  "Project: Bosch Hackathon Finalist Project: Autonomous Traffic Management System\nCategory: Embedded\nDomain: embedded\nTechnologies: YOLOv8, ESP32, MQTT, Python, Roboflow, Motor Drivers, Real-time Detection, Autonomous Control\nDescription:\n- Developed a traffic management system integrating YOLOv8 for traffic and crosswalk detection with ESP32 hardware for real-time signal control.\n",
  "Project: Government Research Project: STIV-based Velocity Estimation for CWPRS(GOI)\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: Python, pyOpenRiverCam, OpenPIV, OpenCV, LSPIV, Government Research\nDescription:\n- Partnering with Central Water and Power Research Station (CWPRS), Government of India, to develop an advanced AI/ML-based velocity estimation system tested at Khadakwasla Dam, Pune.\n",
  "Project: IRIS Club RAG Chatbot - Research Paper Published at IEEE ICoICC 2025\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: LLaMA-3 70B, LangChain, FAISS, Next.js, RAG\nDescription:\n- Engineered a domain-specific RAG chatbot using LLaMA-3 70B, FAISS-based semantic search, and LangChain for efficient IRIS club information retrieval.\n",
  "Project: DocsVerse - Document Research Chatbot\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: React, FastAPI, ChromaDB, RAG, OCR\nDescription:\n- Developed interactive web application for document upload, AI-powered chat with citations, and theme identification.\n",
  "Project: LangGraph Researcher\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: LangChain, LangGraph, Python, Multi-Agent\nDescription:\n- Implemented dual-agent system for deep research using Tavily, LangChain, and LangGraph.\n",
  "Project: SynapTrack - Parkinson\\\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: PyTorch, EEG, CNN, RNN, SHAP\nDescription:\n- Developed ML-based EEG analysis platform for brain activity pattern decoding.\n",
  "Project: Data Orchestrate - Distributed File Sync\nCategory: Full-Stack\nDomain: web-dev\nTechnologies: Java, Spring Boot, Kubernetes, Kafka, MongoDB\nDescription:\n- Built cloud-native, microservices-based file sync system with Docker/Kubernetes deployment.\n",
  "Project: Airfield Wildlife Risk Classification\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: YOLOv8, OpenCV, Flask, Real-time Detection\nDescription:\n- Built real-time bird detection system for airport bird strike prevention.\n",
  "Project: ForVis - Formula 1 Analytics\nCategory: Full-Stack\nDomain: web-dev\nTechnologies: PyQt5, Apache Spark, HDFS, ML\nDescription:\n- Developed dynamic PyQt5 GUI for F1 telemetry analysis.\n",
  "Project: Cardiovascular Diseases Prediction\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: Streamlit, XGBoost, SHAP, Ensemble ML\nDescription:\n- Built comprehensive ML pipeline for cardiovascular disease risk prediction.\n",
  "Project: Tarzan - Autonomous Vehicle Module\nCategory: Embedded\nDomain: embedded\nTechnologies: YOLOv8, C++, Arduino, LiDAR, Sensor Fusion\nDescription:\n- Developing autonomous vehicle module for non-ADAS cars using YOLOv8.\n",
  "Project: MedTech Diagnostic LLM Pipeline\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: MONAI, Swin UNETR, FAISS, BioMistral, FastAPI, Next.js, FHIR, Docker\nDescription:\n- Built an end-to-end AI diagnostic pipeline combining 3D medical image segmentation (MONAI + Swin UNETR), FAISS-based case retrieval, and LLM-driven report generation.\n",
  "Project: IRIS Club Website\nCategory: Full-Stack\nDomain: web-dev\nTechnologies: Next.js, Supabase, Razorpay, TypeScript\nDescription:\n- Developed official website for IRIS club with centralized platform.\n",
  "Project: PlantWise - Ayurvedic AI Companion\nCategory: AI/ML\nDomain: ai-ml\nTechnologies: Cohere API, PyQt, RAG, NLP\nDescription:\n- Built AI-driven health assistant using LLMs for disease prediction.\n",
  "Project: Driver Safety Monitoring System\nCategory: Embedded\nDomain: embedded\nTechnologies: Arduino, C++, IoT, Sensor Integration\nDescription:\n- Integrated MQ3 alcohol sensor, accelerometer, GPS, GSM modules.\n",
  "Kushagra's Technical Skills:\n\nCategory: Languages\n- Python\n- C\n- C++\n- Java\n- JavaScript\n\nCategory: Databases\n- MySQL\n- MongoDB\n- PostgreSQL\n- MongoDB Atlas\n\nCategory: Cloud & DevOps\n- AWS\n- Kubernetes\n- Docker\n- CI/CD Pipelines\n- Minikube\n\nCategory: AI/ML Libraries\n- PyTorch\n- OpenCV\n- Pandas\n- NumPy\n- TensorFlow\n- Scikit-Learn\n- Tkinter\n- StreamLit\n- PyQt5\n- NLTK\n- spaCy\n- LangChain\n- HuggingFace\n\nCategory: Big Data Technologies\n- Cloudera\n- HDFS\n- Apache Pig\n- Hive\n- HBase\n- Apache Spark\n- Kafka\n\nCategory: Web Development\n- Next.js\n- React\n- Node.js\n- Express.js\n- Spring Boot\n- FastAPI\n- HTML\n- CSS\n- Bootstrap\n- WebSockets\n\nCategory: Visualization Tools\n- Tableau\n- Matplotlib\n- Seaborn\n\nCategory: Software & Tools\n- AutoCAD\n- TinkerCAD\n- Jupyter\n- Linux\n- Selenium\n\nCategory: Electronics\n- Arduino\n- Raspberry Pi\n- STM32\n- ESP32\n- Ultrasonic Sensors\n\nCategory: Generative AI\n",
  "Kushagra Singh is a Final Year Computer Science Engineering student at MIT World Peace University, Pune. He's currently in his final year and is passionate about AI/ML and Software Development domains.",
  "Kushagra has earned several notable achievements including: Winner of the Mitsubishi UFJ Financial Group (MUFG) Hackathon 2025, Top 18 Finalist at the Bosch BOROSA Hackathon 2025, Top 100 out of 260,000+ participants at the Adobe Hackathon 2025, Top 25 Finalist at the Smart India Hackathon 2024, Finalist at HackMITWPU'24 Ideathon, and a published researcher in IEEE ICoICC 2025.",
  "Kushagra has diverse professional experience as Technical Head at IRIS, MIT WPU (Aug 2024-Present), Machine Learning Research Associate at IIMT University (Jan 2025-Mar 2025), and ML Project Intern at Infosys Springboard (Oct 2024-Dec 2024).",
  "Kushagra has demonstrated strong leadership as the Technical Head of IRIS, MIT WPU's premier technical club, where he leads a team of 20+ developers across multiple technical domains, manages the club's website and technical infrastructure, organizes technical workshops and hackathons, and mentors junior members.",
  "Kushagra co-authored a research paper titled 'Domain-Specific Conversational AI for IRIS MITWPU: From Research Paper to Production' published in IEEE ICoICC 2025. The paper compares RAG and Fine-Tuned Transformer approaches for domain-specific chatbots.",
  "Kushagra's notable projects include: Adobe Hackathon Finalist (AI-powered PDF analysis platform), Mitsubishi Hackathon Winner (AI-Powered Superannuation Advisor Dashboard), Government Research Project (STIV-based Velocity Estimation for CWPRS), IRIS Club RAG Chatbot, Bosch Hackathon Finalist (Autonomous Traffic Management System), MedTech Diagnostic LLM Pipeline, and more.",
  "DocsVerse is a document research chatbot Kushagra developed that combines OCR with RAG to enable intelligent document analysis and question-answering, processing multiple document formats and providing contextually relevant answers.",
  "SynapTrack is an innovative project for Parkinson's disease detection using EEG analysis, implementing a hybrid deep learning model combining CNN and LSTM architectures to detect subtle patterns in brain activity, achieving 91% accuracy in early-stage detection.",
  "The Airfield Wildlife Risk Classification project is a real-time bird detection system using computer vision with YOLOv8 for enhancing aviation safety, with a risk assessment algorithm evaluating factors like bird size, flock density, and flight patterns.",
  "Kushagra is proficient in multiple programming languages including Python (Advanced), JavaScript/TypeScript (Advanced), Java (Intermediate), C/C++ (Intermediate), SQL (Advanced), HTML/CSS (Advanced), and Bash (Basic).",
  "Kushagra is experienced with various database technologies including relational databases (MySQL, PostgreSQL, SQLite), NoSQL databases (MongoDB), vector databases (FAISS, ChromaDB), time-series databases (InfluxDB), and in-memory databases (Redis).",
  "Kushagra approaches problem-solving methodically by analyzing requirements, researching existing solutions, breaking down complex problems, prioritizing tasks, implementing iteratively, testing continuously, documenting the process, and emphasizing scalable solutions.",
  "Kushagra has a structured approach to learning new technologies by understanding fundamentals, following documentation, building proof-of-concept projects, exploring advanced features, participating in communities, teaching others, and contributing to open-source projects.",
  "Kushagra's career goals include becoming an expert in AI/ML engineering, contributing to cutting-edge research, building products that solve real-world problems, leading technical teams, bridging academic research and industry implementation, and eventually founding a tech startup.",
  "Outside of technology, Kushagra enjoys playing table tennis, reading science fiction, exploring new technologies, mentoring junior students, listening to music, and travelling and exploring new places.",
  "Kushagra's strengths include technical versatility, strong problem-solving abilities, leadership skills, adaptability to new technologies, and communication skills. He's working to improve balancing perfectionism with pragmatic delivery, delegating tasks more effectively, and enhancing public speaking skills.",
  "You can reach Kushagra through the following channels: Email: kushagraa.n@gmail.com, LinkedIn: https://www.linkedin.com/in/kushagra-anit-singh/, GitHub: https://github.com/kushagra-a-singh, Google Scholar: https://scholar.google.com/citations?user=upUymaUAAAAJ&hl=en, Linktree: https://linktr.ee/kushagra_singh. You can also use the contact form on his portfolio website.",
  "Kushagra built this entire portfolio website and chatbot system himself as a personal project to showcase his skills. The portfolio is built with Next.js 14, React, TypeScript, and Tailwind CSS, deployed on Vercel. The chatbot uses a RAG (Retrieval-Augmented Generation) system with Python Flask backend, FAISS vector database, HuggingFace embeddings, and Groq API with LLaMA-3 70B model, deployed on Render.",
  "The chatbot system Kushagra developed includes: Python Flask backend with FAISS vector database for semantic search, HuggingFace all-MiniLM-L6-v2 embeddings for text similarity, Groq API integration with LLaMA-3 70B model for natural language responses, React/TypeScript frontend with real-time chat interface, Supabase integration for conversation logging, and deployment on Render for backend and Vercel for frontend.",
  "Kushagra's portfolio website features: Next.js 14 with React and TypeScript for modern web development, Tailwind CSS for responsive styling and dark mode support, Framer Motion for smooth animations and transitions, custom components and interactive sections, integrated contact forms and chatbot functionality, optimized performance with Next.js best practices, and automatic deployment through Vercel with GitHub integration.",
  "The deployment strategy includes: Vercel for frontend hosting with global CDN and SSL certificates, Render for Python Flask backend hosting, FAISS vector database for efficient semantic search, HuggingFace API for text embeddings, Groq API for LLM responses, Supabase for conversation logging and analytics, and comprehensive error handling and health checks."
]